_putty_open_url(id) {
    WinGetTitle, title
    if (!RegExMatch(title, "[^""]+""urls: (.+)""", out))
        Return
    url := StrSplit(out1, " ")[id]
    If (RegExMatch(url, "^(?:http|www)"))
        Run, %url%
}

#Ifwinactive, ahk_class PuTTY
    ^w::send ^{vk57sc011}

    F1::
    F2::
    F3::
    F4::
    F5::
    F6::
    F7::
    F8::
        _putty_open_url(SubStr(A_ThisHotkey, 2))
    Return

    ~LButton::
        if (A_Cursor == "Unknown")
            send, {shift down}{click}{shift up}
    return

    :*?:ёё0::{esc}j00
    :*?:ёё1::{esc}j01
    :*?:ёё2::{esc}j02
    :*?:ёё3::{esc}j03
    :*?:ёё4::{esc}j04
    :*?:ёё5::{esc}j05
    :*?:ёё6::{esc}j06
    :*?:ёё7::{esc}j07
    :*?:ёё8::{esc}j08
    :*?:ёё9::{esc}j09
    :*?:ё10::{esc}j10
    :*?:ё11::{esc}j11
    :*?:ё12::{esc}j12
    :*?:ё13::{esc}j13
    :*?:ё14::{esc}j14
    :*?:ё15::{esc}j15
    :*?:ё16::{esc}j16
    :*?:ё17::{esc}j17
    :*?:ё18::{esc}j18
    :*?:ё19::{esc}j19
    :*?:ё20::{esc}j20
    :*?:ё21::{esc}j21
    :*?:ё22::{esc}j22
    :*?:ё23::{esc}j23
    :*?:ё24::{esc}j24
    :*?:ё25::{esc}j25
    :*?:ё26::{esc}j26
    :*?:ё27::{esc}j27
    :*?:ё28::{esc}j28
    :*?:ё29::{esc}j29
    :*?:ё30::{esc}j30
    :*?:ё31::{esc}j31
    :*?:ё32::{esc}j32
    :*?:ё33::{esc}j33
    :*?:ё34::{esc}j34
    :*?:ё35::{esc}j35
    :*?:ё36::{esc}j36
    :*?:ё37::{esc}j37
    :*?:ё38::{esc}j38
    :*?:ё39::{esc}j39
    :*?:ё40::{esc}j40
    :*?:ё41::{esc}j41
    :*?:ё42::{esc}j42
    :*?:ё43::{esc}j43
    :*?:ё44::{esc}j44
    :*?:ё45::{esc}j45
    :*?:ё46::{esc}j46
    :*?:ё47::{esc}j47
    :*?:ё48::{esc}j48
    :*?:ё49::{esc}j49
    :*?:ё50::{esc}j50
    :*?:ё51::{esc}j51
    :*?:ё52::{esc}j52
    :*?:ё53::{esc}j53
    :*?:ё54::{esc}j54
    :*?:ё55::{esc}j55
    :*?:ё56::{esc}j56
    :*?:ё57::{esc}j57
    :*?:ё58::{esc}j58
    :*?:ё59::{esc}j59

    :*?:````0::{esc}j00
    :*?:````1::{esc}j01
    :*?:````2::{esc}j02
    :*?:````3::{esc}j03
    :*?:````4::{esc}j04
    :*?:````5::{esc}j05
    :*?:````6::{esc}j06
    :*?:````7::{esc}j07
    :*?:````8::{esc}j08
    :*?:````9::{esc}j09
    :*?:``10::{esc}j10
    :*?:``11::{esc}j11
    :*?:``12::{esc}j12
    :*?:``13::{esc}j13
    :*?:``14::{esc}j14
    :*?:``15::{esc}j15
    :*?:``16::{esc}j16
    :*?:``17::{esc}j17
    :*?:``18::{esc}j18
    :*?:``19::{esc}j19
    :*?:``20::{esc}j20
    :*?:``21::{esc}j21
    :*?:``22::{esc}j22
    :*?:``23::{esc}j23
    :*?:``24::{esc}j24
    :*?:``25::{esc}j25
    :*?:``26::{esc}j26
    :*?:``27::{esc}j27
    :*?:``28::{esc}j28
    :*?:``29::{esc}j29
    :*?:``30::{esc}j30
    :*?:``31::{esc}j31
    :*?:``32::{esc}j32
    :*?:``33::{esc}j33
    :*?:``34::{esc}j34
    :*?:``35::{esc}j35
    :*?:``36::{esc}j36
    :*?:``37::{esc}j37
    :*?:``38::{esc}j38
    :*?:``39::{esc}j39
    :*?:``40::{esc}j40
    :*?:``41::{esc}j41
    :*?:``42::{esc}j42
    :*?:``43::{esc}j43
    :*?:``44::{esc}j44
    :*?:``45::{esc}j45
    :*?:``46::{esc}j46
    :*?:``47::{esc}j47
    :*?:``48::{esc}j48
    :*?:``49::{esc}j49
    :*?:``50::{esc}j50
    :*?:``51::{esc}j51
    :*?:``52::{esc}j52
    :*?:``53::{esc}j53
    :*?:``54::{esc}j54
    :*?:``55::{esc}j55
    :*?:``56::{esc}j56
    :*?:``57::{esc}j57
    :*?:``58::{esc}j58
    :*?:``59::{esc}j59
#Ifwinactive